Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53J20A.atdf
        <register name="MBBUSY0" offset="0x68" rw="R" size="4" initval="0x00000000" caption="MBIST Memory Busy 0">
          <bitfield name="BUSY0" caption="Memory 0 BIST Busy" mask="0x1"/>
          <bitfield name="BUSY1" caption="Memory 1 BIST Busy" mask="0x2"/>
          <bitfield name="BUSY2" caption="Memory 2 BIST Busy" mask="0x4"/>
          <bitfield name="BUSY3" caption="Memory 3 BIST Busy" mask="0x8"/>
          <bitfield name="BUSY4" caption="Memory 4 BIST Busy" mask="0x10"/>
          <bitfield name="BUSY5" caption="Memory 5 BIST Busy" mask="0x20"/>
          <bitfield name="BUSY6" caption="Memory 6 BIST Busy" mask="0x40"/>
          <bitfield name="BUSY7" caption="Memory 7 BIST Busy" mask="0x80"/>
          <bitfield name="BUSY8" caption="Memory 8 BIST Busy" mask="0x100"/>
          <bitfield name="BUSY9" caption="Memory 9 BIST Busy" mask="0x200"/>
          <bitfield name="BUSY10" caption="Memory 10 BIST Busy" mask="0x400"/>
          <bitfield name="BUSY11" caption="Memory 11 BIST Busy" mask="0x800"/>
          <bitfield name="BUSY12" caption="Memory 12 BIST Busy" mask="0x1000"/>
          <bitfield name="BUSY13" caption="Memory 13 BIST Busy" mask="0x2000"/>
          <bitfield name="BUSY14" caption="Memory 14 BIST Busy" mask="0x4000"/>
          <bitfield name="BUSY15" caption="Memory 15 BIST Busy" mask="0x8000"/>
          <bitfield name="BUSY16" caption="Memory 16 BIST Busy" mask="0x10000"/>
          <bitfield name="BUSY17" caption="Memory 17 BIST Busy" mask="0x20000"/>
          <bitfield name="BUSY18" caption="Memory 18 BIST Busy" mask="0x40000"/>
          <bitfield name="BUSY19" caption="Memory 19 BIST Busy" mask="0x80000"/>
          <bitfield name="BUSY20" caption="Memory 20 BIST Busy" mask="0x100000"/>
          <bitfield name="BUSY21" caption="Memory 21 BIST Busy" mask="0x200000"/>
          <bitfield name="BUSY22" caption="Memory 22 BIST Busy" mask="0x400000"/>
          <bitfield name="BUSY23" caption="Memory 23 BIST Busy" mask="0x800000"/>
          <bitfield name="BUSY24" caption="Memory 24 BIST Busy" mask="0x1000000"/>
          <bitfield name="BUSY25" caption="Memory 25 BIST Busy" mask="0x2000000"/>
          <bitfield name="BUSY26" caption="Memory 26 BIST Busy" mask="0x4000000"/>
          <bitfield name="BUSY27" caption="Memory 27 BIST Busy" mask="0x8000000"/>
          <bitfield name="BUSY28" caption="Memory 28 BIST Busy" mask="0x10000000"/>
        </register>
        <register name="MBSTATUS0" offset="0x70" rw="RW" size="4" initval="0x00000000" caption="MBIST Memory Status 0">
          <bitfield name="STATUS0" caption="Memory 0 MBIST Status" mask="0x1"/>
          <bitfield name="STATUS1" caption="Memory 1 MBIST Status" mask="0x2"/>
          <bitfield name="STATUS2" caption="Memory 2 MBIST Status" mask="0x4"/>
          <bitfield name="STATUS3" caption="Memory 3 MBIST Status" mask="0x8"/>
          <bitfield name="STATUS4" caption="Memory 4 MBIST Status" mask="0x10"/>
          <bitfield name="STATUS5" caption="Memory 5 MBIST Status" mask="0x20"/>
          <bitfield name="STATUS6" caption="Memory 6 MBIST Status" mask="0x40"/>
          <bitfield name="STATUS7" caption="Memory 7 MBIST Status" mask="0x80"/>
          <bitfield name="STATUS8" caption="Memory 8 MBIST Status" mask="0x100"/>
          <bitfield name="STATUS9" caption="Memory 9 MBIST Status" mask="0x200"/>
          <bitfield name="STATUS10" caption="Memory 10 MBIST Status" mask="0x400"/>
          <bitfield name="STATUS11" caption="Memory 11 MBIST Status" mask="0x800"/>
          <bitfield name="STATUS12" caption="Memory 12 MBIST Status" mask="0x1000"/>
          <bitfield name="STATUS13" caption="Memory 13 MBIST Status" mask="0x2000"/>
          <bitfield name="STATUS14" caption="Memory 14 MBIST Status" mask="0x4000"/>
          <bitfield name="STATUS15" caption="Memory 15 MBIST Status" mask="0x8000"/>
          <bitfield name="STATUS16" caption="Memory 16 MBIST Status" mask="0x10000"/>
          <bitfield name="STATUS17" caption="Memory 17 MBIST Status" mask="0x20000"/>
          <bitfield name="STATUS18" caption="Memory 18 MBIST Status" mask="0x40000"/>
          <bitfield name="STATUS19" caption="Memory 19 MBIST Status" mask="0x80000"/>
          <bitfield name="STATUS20" caption="Memory 20 MBIST Status" mask="0x100000"/>
          <bitfield name="STATUS21" caption="Memory 21 MBIST Status" mask="0x200000"/>
          <bitfield name="STATUS22" caption="Memory 22 MBIST Status" mask="0x400000"/>
          <bitfield name="STATUS23" caption="Memory 23 MBIST Status" mask="0x800000"/>
          <bitfield name="STATUS24" caption="Memory 24 MBIST Status" mask="0x1000000"/>
          <bitfield name="STATUS25" caption="Memory 25 MBIST Status" mask="0x2000000"/>
          <bitfield name="STATUS26" caption="Memory 26 MBIST Status" mask="0x4000000"/>
          <bitfield name="STATUS27" caption="Memory 27 MBIST Status" mask="0x8000000"/>
          <bitfield name="STATUS28" caption="Memory 28 MBIST Status" mask="0x10000000"/>
        </register>
        <register name="DCFG" offset="0xF0" rw="RW" size="4" count="2" initval="0x00000000" caption="Device Configuration">
          <bitfield name="DCFG" caption="Device Configuration" mask="0xFFFFFFFF"/>
        </register>
        <register name="ENTRY0" offset="0x1000" rw="R" size="4" initval="0x9F0FC002" caption="CoreSight ROM Table Entry 0">
          <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="ENTRY1" offset="0x1004" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Entry 1">
        </register>
        <register name="END" offset="0x1008" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table End">
          <bitfield name="END" caption="End Marker" mask="0xFFFFFFFF"/>
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Memory Type">
          <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 4">
          <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="FKBC" caption="4KB count" mask="0xF0"/>
        </register>
