Duet3D/Duet3Expansion/src/atmel/SAME53_DFP/1.0.57/atdf/ATSAME53J20A.atdf
        <register name="EICCPUSEL0" offset="0x120" rw="RW" size="4" initval="0x00000000" caption="EIC External Interrupts CPU Select 0">
          <bitfield name="EXTINT0" caption="External Interrupt 0 CPU Select" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 CPU Select" mask="0x4"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 CPU Select" mask="0x10"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 CPU Select" mask="0x40"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 CPU Select" mask="0x100"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 CPU Select" mask="0x400"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 CPU Select" mask="0x1000"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 CPU Select" mask="0x4000"/>
          <bitfield name="EXTINT8" caption="External Interrupt 8 CPU Select" mask="0x10000"/>
          <bitfield name="EXTINT9" caption="External Interrupt 9 CPU Select" mask="0x40000"/>
          <bitfield name="EXTINT10" caption="External Interrupt 10 CPU Select" mask="0x100000"/>
          <bitfield name="EXTINT11" caption="External Interrupt 11 CPU Select" mask="0x400000"/>
          <bitfield name="EXTINT12" caption="External Interrupt 12 CPU Select" mask="0x1000000"/>
          <bitfield name="EXTINT13" caption="External Interrupt 13 CPU Select" mask="0x4000000"/>
          <bitfield name="EXTINT14" caption="External Interrupt 14 CPU Select" mask="0x10000000"/>
          <bitfield name="EXTINT15" caption="External Interrupt 15 CPU Select" mask="0x40000000"/>
        </register>
        <register name="INTCPUSEL0" offset="0x128" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 0">
          <bitfield name="PAC" caption="PAC Interrupt CPU Select" mask="0x1"/>
          <bitfield name="PM" caption="PM Interrupt CPU Select" mask="0x4"/>
          <bitfield name="MCLK" caption="MCLK Interrupt CPU Select" mask="0x10"/>
          <bitfield name="OSCCTRL" caption="OSCCTRL Interrupt CPU Select" mask="0x100"/>
          <bitfield name="OSC32KCTRL" caption="OSC32KCTRL Interrupt CPU Select" mask="0x400"/>
          <bitfield name="SUPC" caption="SUPC Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="WDT" caption="WDT Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="RTC" caption="RTC Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="EIC" caption="EIC Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="FREQM" caption="FREQM Interrupt CPU Select" mask="0x400000"/>
          <bitfield name="SERCOM0" caption="SERCOM0 Interrupt CPU Select" mask="0x1000000"/>
          <bitfield name="SERCOM1" caption="SERCOM1 Interrupt CPU Select" mask="0x4000000"/>
          <bitfield name="TC0" caption="TC0 Interrupt CPU Select" mask="0x10000000"/>
          <bitfield name="TC1" caption="TC1 Interrupt CPU Select" mask="0x40000000"/>
        </register>
        <register name="INTCPUSEL1" offset="0x12C" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 1">
        </register>
        <register name="INTCPUSEL2" offset="0x130" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 2">
          <bitfield name="USB" caption="USB Interrupt CPU Select" mask="0x1"/>
          <bitfield name="NVMCTRL" caption="NVMCTRL Interrupt CPU Select" mask="0x10"/>
          <bitfield name="DMAC" caption="DMAC Interrupt CPU Select" mask="0x400"/>
          <bitfield name="EVSYS" caption="EVSYS Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="PICOP" caption="PICOP Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="SERCOM2" caption="SERCOM2 Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="SERCOM3" caption="SERCOM3 Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="TCC0" caption="TCC0 Interrupt CPU Select" mask="0x400000"/>
          <bitfield name="TCC1" caption="TCC1 Interrupt CPU Select" mask="0x1000000"/>
          <bitfield name="TC2" caption="TC2 Interrupt CPU Select" mask="0x4000000"/>
          <bitfield name="TC3" caption="TC3 Interrupt CPU Select" mask="0x10000000"/>
          <bitfield name="TAL" caption="TAL Interrupt CPU Select" mask="0x40000000"/>
        </register>
        <register name="INTCPUSEL3" offset="0x134" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 3">
          <bitfield name="RAMECC" caption="RAMECC Interrupt CPU Select" mask="0x1"/>
        </register>
        <register name="INTCPUSEL4" offset="0x138" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 4">
          <bitfield name="CAN0" caption="CAN0 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="CAN1" caption="CAN1 Interrupt CPU Select" mask="0x4"/>
          <bitfield name="GMAC" caption="GMAC Interrupt CPU Select" mask="0x10"/>
          <bitfield name="TCC2" caption="TCC2 Interrupt CPU Select" mask="0x40"/>
          <bitfield name="TCC3" caption="TCC3 Interrupt CPU Select" mask="0x100"/>
          <bitfield name="TC4" caption="TC4 Interrupt CPU Select" mask="0x400"/>
          <bitfield name="TC5" caption="TC5 Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="PDEC" caption="PDEC Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="AC" caption="AC Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="AES" caption="AES Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="TRNG" caption="TRNG Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="ICM" caption="ICM Interrupt CPU Select" mask="0x400000"/>
          <bitfield name="PUKCC" caption="PUKCC Interrupt CPU Select" mask="0x1000000"/>
          <bitfield name="QSPI" caption="QSPI Interrupt CPU Select" mask="0x4000000"/>
        </register>
        <register name="INTCPUSEL5" offset="0x13C" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 5">
        </register>
